a= list(x1=c(1,3,3,4,5), x2=c("a","b","c"), x3=c(10,20)); a

a[[2]][2] #λιστα και στοιχειο απο αυτη που ζητάμε.

a$x3[2]

data1=data.frame(gender=c("f","f","m","m"), age=c(24,23,25,20), weight=c(75,81,68,62))
data1
data1$weight
mean(data1$weight)
sd(data1$weight)
data1$weight[2]
data1$weight[3]=82
data1


x=c(1,3,4,8,6)
plot(x)
x=c(1,4,8)
y=c(1,4,16)
plot(x,y, type="h")

#Γράφημα σ.π.π. κανονικής κατανομής
#Θα γραψουμε πρωτα τον αξονα χ των σημειων της κατανομης σε μορφη sequence
#Και μετά θα γραψουμε ως y την συναρτηση πιθανοτητας
#Επειτα ζηταμε το κοινο της γραφημα

x=seq(-3,3,0.2)
y=1/sqrt(2*pi)*exp(-x^2/2)
plot(x,y, type="l")
points(c(0),c(0.4))
lines(c(0,0), c(0,0.4))
lines(x+0.1,y,type="l")
points(x+0.1,y)

dnorm
pnorm
qnorm

dgamma
pgamma
qgamma

y=pnorm(x,0,1)
pnorm(c(-3,3),0,1)

a=0.05; qnorm(1-a/2,0,1)

x=rnorm(1000,0,1) #function για παραγωγη 10 τυχαιων αριθμων απο την κανονικη κατανομη με μ=0 και σ=1
summary(x)
max(x)
min(x)
x
hist(x,30,prob=TRUE) #30 ειναι οι κλασεις που θετουμε εδω
#με το prob=TRUE κανουμε τις κλασεις να εκφραζουν σχετικες συχνοτητες (αθροισμα=1) και οχι απολυτες

#μπορω να ορισω και τις καλσεις με εντολη sequence
hist(x,seq(-3,3,0.1),prob=TRUE)
max(x)
min(x)
#το error για το διαστημα -3,3 εχει να κανει με το οτι υπαρχουν τιμες του x περα απο τα ακρα του διαστηματος
#εαν ωστοσο θελουμε να διατηρησουμε το διαστημα, δημιουργουμε συνθηκη που εξαιρει τα "ανυπακουα" x

hist(x[x>-3 & x<3], seq(-3,3,0.1), prob=TRUE)

qqnorm(x); qqline(x) #η γραμμη πανω στην οποια πρεπει να βρισκονται τα σημεια για να θεωρηθει οτι ειναι απο την κανονικη κατανομη
boxplot(x) #θηκογραμμα

f=function(x){x^2+3} #κατασκευη δικης μας συναρτησης. Οι αγκύλες ειναι το output της συναρτησης. Οι παρενθεσεις ειναι το input, οι παραμετροι

f(2)
f(1)
x=seq(-5,5,0.1)
plot(x,f(x))

x0=c(104.3,99.1,102.6,101.1,95.5,108.8)
summary(x0)
mu0=100; #ελεγχος υποθεσης μεσου του δειγματος
#θα χρησιμοποιησουμε την ελεγχοσυναρτηση T= (x̄-μο) /S/ √n
#Η οποια υπο την Ηο ακολουθει tn-1

t.test(x0,mu=mu0, conf.level=0.99)

#θα μπορουσαμε να τα κατασκευασουμε και μονοι μας ως εξης

(mean(x0)-mu0)/(sd(x0)/length(x0)^0.5)

#ξεχωριστος υπολογισμος pvalue
#Η περιοχη απορριψης ειναι:
##|T|>t(a/2),n-1 σε απολυτο γιατι ο ελεγχος ειναι αμφιπλευρος
##pvalue=P(|T|>=|t| | Ho) = 2*(1-Ft(n-1)(|t|))

t=(mean(x0)-mu0)/(sd(x0)/length(x0)^0.5)

2*(1-pt(abs(t), length(x0)-1))

y0=c(103.1,110.9,115.2,109.1)
t.test(x0,y0, alternative="less", var.equal=TRUE, paired=FALSE)
#less, δλδ μ1=μ2 και ενναλακτικη μ1<μ2, ιδια διασπορα(ομοσκεδαστικοι πληθυσμοι), χωρις ζευγαρωτες παρατηρησεις

#F τεστ, ελεγχος ισοτητας διασπορων

var.test(x0,y0, ratio=1, alternative="two.sided")
#ratio =1 δηλαδη οτι σ1/σ2 = 1

#ελεγχος κανονικοτητας δειγματος

ks.test(x0, "pnorm", mean=mean(x), sd=sqrt(var(x)))

#το pvalue ειναι 2.2 *10^(-16) αρα δεν μπορουμε να πουμε οτι προερχεται απο κανονικη κατανομη

#ελεγχος ισοτητας κατανομων

x1=c(4,9,10,16,22,5); y1 = c(19,13,20,31,23); ks.test(x1,y1)

#Απλη γραμμικη παλινδρομηση

X=c(4,9,10,16,22,5); Y=c(12,19,13,20,31,23); plot(X,Y)
fit0=lm(Y~X) #linear model = lm
summary(fit0)
anova(fit0)
b0=coefficients(fit0)[[1]]; b1=coefficients(fit0)[[2]]
b0; b1

x=seq(5,20,0.1); lines(x,b0+b1*x, col="slateblue")
