#Εισαγωγη στις μεθοδους προσομοιωσης: Ολοκληρωση Monte Carlo, Ψευδοτυχαίοι αριθμοί
#mod = υπολοιπο ακεραιας διαιρεσης. Συμβολιζεται με %%

m=2^32; a=7^5; x=10^5
for(i in 1:10){x=((a*x) %% m); print(x)}

#θελουμε ομοιομορφα κατανεμημενους στο (0,1), αρα θα διαιρεσουμε με το m

for(i in 1:10){x=((a*x)%%m); print(x/m)}

#για να μην εμφανιζονται οι παραγωμενοι αριθμοι στην κονσολα, θα φροντισουμε να τους καταχωρησουμε σε λιστα
#αυτο μπορουμε να το κανουμε με τη δημιουργια μιας μεταβλητης U

m=2^32; a=7^5; x=2*10^5+3; n=10^4; U=rep(0,n);

for(i in 1:n){x=((a*x)%%m);U[i]=x/m}
U
plot(U)
#παρατηρουμε οτι το πληθος των τ.α. ειναι περιπου το ιδιο σε καθε κλαση, πραγμα που θελουμε (ομοιομορφη)
hist(U)
hist(U,100)

#θελουμε να παραξουμε πληθος τ.α. απο την κατανομη μας, αρα θα χρησιμοποιησουμε τον αριθμο r στην εντολη μας

set.seed(2);runif(100) #τπ πληθος των τ.α. που θελουμε

hist(runif(10^5))
plot(runif(10^4))
#αν δεν βαλουμε seed το προγραμμα λαμβανει την πρωτη τιμη απο το ρολοι του υπολογιστη

#υπολογισμος μεσης τιμης και ολοκληρωματος

n=10^6; U=runif(n); Y=log(U); mean(Y)

#αλλο παράδειγμα: Υπολογισμος ολοκληρωματος lnu*exp(u)du = E(lnU*exp(U)), U~U(0,1)
#το μονο που θα αλλαξει ειναι ο τυπος της Υ

n=10^6; U=runif(n); Y=log(U)*exp(U); mean(Y)

#με δ.ε. μπορουμε να δουμε ποσο κοντα ειναι η εκτιμηση του προσομοιωτικου μοντελου στον πραγματικο μεσο

#ΜΕΘΟΔΟΣ MONTE CARLO

n=10^8; U1=runif(n); U2=runif(n); Y= exp(-(U1+U2)^2); mean(Y)
hist(Y,200,prob=TRUE)
#ισχύει ότι histogram ≈ σ.π.π. για μεγάλο δείγμα

#ΚΑΤΑΣΚΕΥΗ Δ.Ε.
m=mean(Y)
a=0.01; s=sd(Y); #<- δειγματική τυπική απόκλειση
z=qnorm(1-a/2,0,1) #τυπικής κανονικής
c(m-s/n^0.5*z, m+s/n^0.5*z) #δ.ε.

#μπορούμε αντί να κρατάμε ολόκληρο το δείγμα να φτιαξουμε βρόχο επανάληψης















