#ΚΕΦΑΛΑΙΟ 3 (ΑΝΤΙΣΤΡΟΦΗ ΓΙΑ ΔΙΑΚΡΙΤΕΣ ΚΑΤΑΝΟΜΕΣ)

#ΒΗΜΑ 1: Παραγουμε τ.α. U~U(0,1) και θετουμε i=0
#ΒΗΜΑ 2: Εάν U > po + p1 + ... + pi τοτε αυξάνουμε το i κατα 1 και ξαναεκτελουμε το ΒΗΜΑ 2
#ΒΗΜΑ 3: Μολις παυσει να ισχυει το ΒΗΜΑ 2, θετουμε X = xi

#εστω οτι θελουμε να παραγουμε τ.α. απο κατανομη με σ.π.
#p1=0.20, p2=0.15, p3= 0.25, p4= 0.4 και x1=1, x2=3, x3=5, x4=7

x=c(1,3,5,7)
p=c(0.2,0.15,0.25,0.4); k= length(p);

#U~U(0,1) p1=0.2, p1+p2=0.35, p1+p2+p3=0.6, p1+p2+p3+p4=1

F=rep(0,k); for(i in 1:k){F[i]=sum(p[1:i])}
F
n=10^5; Y=rep(0,n);
for(j in 1:n ){U=runif(1); i=1; while(U>F[i]){i=i+1}; X=x[i]; Y[j]=x[i]}
#Y
table(Y)
#αφου αυξησουμε το δειγμα διαπιστωνουμε οτι ταιριαζουν τα p με τα πληθη τους
#αρα ο αλγοριθμος μας λειτουργει καλα

#ΟΜΟΙΟΜΟΡΦΗ ΚΑΤΑΝΟΜΗ

n=10^3; k=6; U=runif(1); X=floor(k*U)+1 #το floor είναι το ακέραιο μέρος
X
#μπορουμε να βαλουμε κατευθειαν μεσα την runif

n=6*10^3;k=6;X=floor(k*(runif(n)))+1
X
table(X)

#2 ζαρια και θελουμε να βρουμε την κατανομη αθροισματος τους
#Ζ=Ζ1+Ζ2, Ζ1,Z2~DU{1,2,...,6}, P(Z=i)=; (από 2,...,12)

n=10^5; k=6; Z1=floor(k*runif(n))+1; Z2=floor(k*runif(n))+1

Z=Z1+Z2
table(Z)
barplot(table(Z))

#ΓΕΩΜΕΤΡΙΚΗ ΚΑΤΑΝΟΜΗ (p= πιθ. επιτυχίας)

n=10^5; p=0.2; U=runif(n); X=floor(log(U)/log(1-p))+1;

table(X) #παρατηρούμενες συχνότητες

i=1:50; floor(n*p*(1-p)^(i-1)); #αναμενομενες συχνοτητες

#συμφωνουν αρκετα αρα ειναι πραγματι απο τη γεωμετρικη κατανομη

mean(X)

barplot(table(X))

#ΚΑΤΑΝΟΜΗ POISSON (Δεν εχει κλειστο τυπο, παμε με τον γενικο αλγοριθμο!)

#ΒΗΜΑ 1: Παραγουμε τ.α. U~U(0,1)
#ΒΗΜΑ 2: Θέτουμε p= exp(-lambda), F=p, i=0
#ΒΗΜΑ 3: Εάν U>F τότε p=p*λ/(i+1), F=F+p, i = i+1 και το εκτελουμε πάλι
#ΒΗΜΑ 4: Θέτουμε X=i

lambda=5;

U=runif(1); p=exp(-lambda); F=p; i=0;

while(U>F){p=p*lambda/(i+1); F=F+p; i=i+1}
X=i
X

#αντι να κανουμε αυτο καθε φορα μπορουμε να ορίσουμε μα συνάρτηση
lambda=5;

rpoisson=function(lambda)
{U=runif(1); p=exp(-lambda); F=p; i=0;
  while(U>F){p=p*lambda/(i+1); F=F+p; i=i+1}; i}
rpoisson(10)

n=10^5; X=rep(0,n); for(j in 1:n){X[j]=rpoisson(30)}
table(X)
mean(X)
var(X)

barplot(table(X))
i=0:10; n*exp(-3)*3^i/factorial(i)
table(X)

#η ετοιμη εντολη στο R
rpois(10,3)

#ΔΙΩΝΥΜΙΚΗ (ωσαν την Poisson)









