2+3
2^20
(1+23)*12/2^2
x<-2+3
x=2+3
x
x=1+2; x
x=x+1
x
y=x^2/2; y
print(x
      )
x=2+4 #to apotelesma ktlp
x
objects()

x=c(1,2,4,5.2)
x
z=c(x,x^2,12,13)
z
x
x^2
(x+1)^2
x*(x+2)
y=x*(x+2); y
x+y
i=(1:10); i
i=1:30
i
seq(1,3,0.2)
seq(1,20,1)
rep(0,10)
rep(c(1,2),each=4)
2^3
x=1:10; x^2
exp(3)
log(2)
sqrt(120)
x=(0:6-3)/2; x
#ας πούμε ότι θέλουμε να βρούμε την τιμή της 1/2π*e^(-(x^2/2))
1/sqrt((2*pi))*exp(-(x^2/2))
y=1/sqrt((2*pi))*exp(-(x-2)^2/2); y
exp(1:10)
x=c(1,3,5,4,3,2,7,4)
min(x)
max(x)
sum(x)
prod(x)
length(x)
mean(x)
var(x)
sum(x)/length(x)
sum((x-mean(x))^2)/(length(x)-1)
x=c("male", "female")
rep(x,c(2,3))
x=c(TRUE,TRUE,FALSE); x
x*2
x*1
sum(x) #δειχνει ποσα ειναι τα TRUE
#το διαφορο γραφεται ως !=
2>1
c(2,2,3,4)>c(3,2,3,1)
x=c(1,3,5,6,3,2); sum(x>2) #Το σκετο χ>2 μας δειχνει ΠΟΙΕΣ τιμες. Το αθροισμα μας λεει ΠΟΣΕΣ τιμες ξεπερνουν το 2.θυμαμαι οτι τα TRUE είναι 1 και τα FALSE 0
y=(1:10); x=((y>1)&(y<=4)|(y==8)) #! einai to not, | einai to or & einai to kai
print(x)
x=c(1,2,NA,5); x
0/0

x=1:10/10; x
x[3]+x[4]
x[3]=0
x=x[-7]
x
x[x>0.3 & x<=0.8]

#if(συνθήκη){εντολές1}else{εντολές2}
x=-2; if(x>0){x}else{-x}

#for(x in λίστα){εντολές}

for(x in 1:10){print(c(x,x^2))}

s=0; for(i in 1:10){s=s+i; print(s)}

#while(συνθήκη){εντολές}

i=0; while(i<10){print(i); i=i+1}
z=c(1,3,5,9,2,4)
dim(z)=c(3,2)
z
z[3,2]
z[2,]
z[,1]
z=z*2
z^0.5
z*z #ΠΡΟΣΟΧΗ! αυτός είναι πολλαπλασιασμός ΣΤΟΙΧΕΙΩΝ και ΟΧΙ ΠΙΝΑΚΩΝ!

A=c(1,2,3,4); dim(A)=c(2,2)
B=c(1,1,2,2); dim(B)=c(2,2)

A+B
A*B
A%*%B #ΑΥΤΟΣ είναι πολλαπλασιασμός ΠΙΝΑΚΩΝ!
t(A) #ΑΝΑΣΤΡΟΦΟΣ ενος πινακα (στηλες σε γραμμες)
diag(c(1,1,1))

diag(3) #απλή κατασκευή μοναδιαίου πίνακα 3x3
det(A) #Η ορίζουσα του πίνακα Α

C=solve(A) #ΑΝΤΙΣΤΡΟΦΟΣ Α
C
A%*%C #Μας δινουν, φυσικα, τον μοναδιαίο των διαστάσεών τους

eval= eigen(A)$val; print(eval) #για τις ιδιοτιμες του πίνακα Α

evec=eigen(A)$vec; print(evec) #για τα ιδιοδιανύσματα του πίνακα Α

D=evec%*%diag(eval) %*%solve(evec) #το γινόμενο των ιδιοδιανυσμάτων με τη διαγώνιο των ιδιοτιμών και με τον ανίστροφο των ιδιοδιανυσμάτων μας δίνει τον αρχικό πίνακα Α
D
