#REVISION EXCERCISES

#ΑΣΚΗΣΗ 1: Εστω U1,U2 ανεξ. τ.μ. ~ U(0,1) και
# X =- log(U1+U2). Μέσω προσομοίωσης:
#α) εκτιμήστε τη μορφή που έχει η σ.π.π. της Χ (μέσω ιστογράμματος
# με εύρος κλάσεων 0.05)
#β) Εκτιμήστε τη μέση τιμή Ε(Χ) και τη διασπορά V(X)

#a) & b)
n=10^5; U1= runif(n); U2=runif(n); X=-log(U1+U2)
mean(X)
var(X)
hist(X[X>-1&X<3],seq(-1,3,0.05),100, prob=TRUE)
m=mean(X)
s=var(X)
print(paste0("estimated mean=",m))
print(paste0("estimated cariance=",s))

#γ) ΑνΧ1,Χ2,...,Χk ανεξ. τ.μ. ~ κατανομη της Χ,
#να βρείτε τη μορφή της κατανομής της τ.μ. Υ= Χ1+Χ2+..+Χk
#με k=20 και να εκτιμησετε την πιθανοτητα P(Y>5)

n=10^5; Y=rep(0,n); k=20; j=0; t=5;
for(i in 1:n){
  U1=runif(k); U2=runif(k); Y[i]=sum(-log(U1+U2));
  if(Y[i]>t){j=j+1}}
print(paste0("estimated P(Y>t)=", j/n))
hist(Y,100,prob=TRUE)

#ΑΣΚΗΣΗ 2:Να παραγετε μέσω αντιστροφής τ.α. απο την κατανομή με σ.κ.
#F(x)= 1-1/x^2, x>1
#α) Να συγκρίνετε τηναντιστοιχη σ.π.π. με το ιστογραμμα n=10^6 παραγόμενων
#αριθμών (το εύρος των κλάσεων του ιστογραμματος να είναι 0.05)

n=10^6; U=runif(n);
dX<-expression(1-1/x^2)
X<-D(dX,"x")
#βγαινει χ/(χ^2)^2 την οποια εξισωνω με u και λυνω ως προς χ (αντιστροφη) με το χερι
#ειναι η:
X=1/(1-U)^(1/2);
#hist(X,100,prob =TRUE, seq(1,5,0.05))
hist(X[X<5],prob=TRUE, seq(1,5,0.05))
x=seq(1,5,0.05); lines(x,2/x^3)

#β)Αν Υ=-Χ*log(X-1) βρειτε την μορφη της κατανομης της Υ
#Με εύρος κλασης 0.1 στο (-8,8) και εκτιμηστε την Ε(Υ)
#και το ανω σημειο της. (c:P(Y>c)=a=0.05)

Y=-X*log(X-1);
hist(Y[Y>-8&Y<8], seq(-8,8,0.1));
print(mean(Y))
#sY=sort(Y); a=0.05; print(paste0("c=",sY[n*(1-a)]))
quantile(Y,1-a)

#γ) Να εκτιμησετε την Ε(max(X1+X2+..+Xk)), k=10

n=10^6; k=10; W=rep(0,n);
for(i in 1:n){U=runif(k); X=1/(1-U)^(1/2); W[i]=max(X)}
mean(W)


#ΑΣΚΗΣΗ 3: Χ1,Χ2,...,Χn1 ~Ν(μ1,σ1^2) και Υ1,Υ2,...,Υn2 ~N(μ2,σ2^2)
#Ηο:σ1^2/σ2^2=1 εναντι Η1: σ1^2/σ2^2>1 (ε.π. μονοπλευρος, για ομοσκεδαστικοτητα)
#απορριπτουμε την Ηο οταν Τ=S1^2/S2^2>c.
#Προσομοιώστε k=10^5 πλήθος τιμών Τ1,...,Τk της τ.μ. Τ, όταν μ1=0,μ2=1,σ1=1,σ2=1
#και n1=25, n2=15 και
#i) Να εκτιμησετε μεσω ιστογράμματος την κατανομη που η Τ~ (υπό Ηο)
#καθώς και το pvalue του δειγμ. στο οποιο βρεθηκε T=t=3
#ii) Να εκτιμησετε το c που οδηγει σε σφαλμα τυπου Ι ισο με α=0.05
#iii) Εκτιμηστε την ισχυ του ελεγχου οταν σ1=1.5, σ2=1 (σε α=0.05)

#i

k=10^5; m1=0; m2=1; s1=1; s2=1; n1=25; n2=15;
T=rep(0,k); j=0; t=3;
for(i in 1:k)
{X=rnorm(n1,m1,s1); Y=rnorm(n2,m2,s2);
  T[i]=var(X)/var(Y);
  if(T[i]>t){j=j+1}}
print(paste0("estimated p-value=",j/k))                                                            
hist(T[T<4], seq(0,4,0.05), prob=TRUE)

#ii

a=0.05; c1=quantile(T,1-a); print(paste0("estimated c =", c1))

#iii
k=10^5; m1=0; m2=1; s1=1.5; s2=1; n1=25; n2=15; T=rep(0,k);
for(i in 1:k)
  {X=rnorm(n1,m1,s1); Y=rnorm(n2,m2,s2); T[i]=var(X)/var(Y)}
print(paste0("estimated power=",mean(T>c1)))

hist(T[T<8], seq(0,8,0.1), prob=TRUE,ylim=c(0,0.9))
x=seq(0,4,0.05); lines(x,df(x,n1-1,n2-1))

#ΑΣΚΗΣΗ 4:
# Ένα χαρτοφυλάκιο αποτελείται από 𝑘 = 100 ασφαλιστήρια συμβόλαια,
# καθένα εκ των οποίων απαιτεί αποζημίωση (σε ένα συγκεκριμένο χρονικό διάστημα)
#με πιθανοτητα  𝑝 = 0.1. Συμβολίζουμε με 𝑀~𝐵𝑖(𝑘, 𝑝) το πλήθος των αποζημιώσεων
# και με Xi το χρηματικό ύψος της 𝑖-αποζημίωσης (× 103€).
#Αν οι 𝑋1, 𝑋2, … είναι αν.ισ. τ.μ. που έχουν σ.κ 𝐹(𝑥)=1−𝑒−4𝑥2,𝑥>0
#εκτιμήστε τη μορφή της σ.π.π. της συνολικής αποζημίωσης και
#επίσης εκτιμήστε την αξία σε κίνδυνο (VaR(0.005)) του χαρτοφυλακίου

n=10^6; W=rep(0,n); k=100; p=0.1;
for(i in 1:n){M=rbinom(1,k,p); U=runif(M); X=(-1/4*(log(1-U)))^0.5; W[i]=sum(X) }
hist(W,100, prob=TRUE)
a=0.005; quantile(W,1-a)
#(μεγιστη δυνητικη απώλεια 1-α= 99.5% ^ περιπου 8857$)

#ΑΣΚΗΣΗ 5:
#Θεωρούμε ότι η τ.μ. 𝑆(𝑡) = 𝑆(0)𝑒𝜇𝑡+𝜎√𝑡𝑍, 𝑍~𝑁(0,1)
#εκφράζει την χρηματιστηριακή τιμή μιας μετοχής 𝛭 μετά από χρόνο 𝑡 = 0.5
#όπου η τάση 𝜇 = 0.1 και 𝜎 = 0.4 η μεταβλητότητα της τιμής (𝑆(0) = 100)
#Μέσω προσομοίωσης:

#α)Εκτιμήστε τη μορφή που έχει η σ.π.π. της τ.μ. 𝑆(𝑡)

#β)Εκτιμήστε την παρούσα αξία του αναμενόμενου κέρδους ενός δικαιώματος αγοράς:

#𝐶0 = 𝑒−𝑟𝑡𝐸(max{𝑆(𝑡) − 𝐾, 0})
#καθώς και την πιθανότητα 𝑃(𝑆(𝑡) > 𝐾) (𝑟 = 0.05, 𝐾 = 120).

mu=0.1; sigma=0.4; t=0.5; n=10^5; r=0.05; K= 120; Z=rnorm(n); S0=100;

St=S0*exp(mu*t+sigma*t^0.5*Z)

#α)

hist(St[St>40&St<250], seq(40,250,2))

#β)

exp(-r*t)*mean(pmax(St-K,0))
mean(St>K)

#γ)Αν 𝑆1, 𝑆2, … 𝑆𝑘+1, 𝑘 = 103, η τιμή της μετοχής στους χρόνους
#0, ℎ, 2ℎ, … , 𝑘ℎ = 𝑡, , θεωρούμε ότι ισχύει το αναδρομικό μοντέλο
# 𝑆𝑖+1 = 𝑆𝑖 𝑒𝜇ℎ+𝜎√ℎ𝑒𝑖 , 𝑖 = 1,2, …
#όπου 𝑒1, 𝑒2, … είναι ανεξάρτητες 𝛮(0,1) τυχαίες μεταβλητές.
#Να παράγετε μια διαδρομή της τιμής (𝑆𝑖ℎ, 𝑖 = 0,1,2 … )
#και να κατασκευάσετε το γράφημά της. Εκτιμήστε μέσω προσομοίωσης
#την μορφή της κατανομής της μέγιστης τιμής της μετοχής στο
#στο [0, 𝑡]: 𝑀𝑆 = max{𝑆1, 𝑆2, … , 𝑆𝑘+1}, καθώς και την Ε(MS)

S0=100; k =10^3; h=t/k; S=rep(0,k+1); S[1]=S0;
for(i in 1:k){S[1+1]=S[i]*exp(mu*h+sigma*h^0.5*rnorm(1))}
plot(seq(0,t,h), S,type="l")

n=10^4; MS=rep(0,n)
for(j in 1:n)
  {for(i in 1:k){S[1+1]=S[i]*exp(mu*h+sigma*h^0.5*rnorm(1))}
MS[j]=max(S)
}
hist(MS,50)
mean(MS)








